Autodesk.Revit.DB.Events.FileExportingEventArgs.Format
Identifies the export format, e.g. DWG or image.
Since:
2010

Autodesk.Revit.DB.Events.FileExportingEventArgs.Path
The target path for the export.
Remarks:
When several files are exported at the same time, 'Path' property will just report the directory instead of those full file names.
Since:
2010

Autodesk.Revit.DB.Events.FileExportingEventArgs
The event arguments used by the FileExporting event.
Since:
2010